; domain
(define (domain messy_house)
	(:requirements :strips)
	(:predicates 
		(at ?c ?x) (next ?from ?to) (holding ?x) (empty-hands ?c) (half-open ?k) (door-between ?x ?y) (dust-in ?x) 
		(cleaner ?c) (trash ?t) (key ?k) (vacuum ?v) (place ?p) (safe-place ?s) (recycle ?t) (open ?x) (empty-sack ?c) (in-sack ?t))

	(:action move
		:parameters (?c ?from ?to)
		:precondition (and (cleaner ?c) (at ?c ?from) (next ?from ?to) (next ?to ?from) (place ?from) (or (place ?to) (safe-place ?to))
						(not (door-between ?from ?to)) (not (door-between ?to ?from)) (not (dust-in ?to)))
		:effect ( and (at ?c ?to) (not (at ?c ?from)))
			 
	)
	
	(:action recycle_trash
	    :parameters (?c ?p ?t)
	    :precondition (and (cleaner ?c) (trash ?t) (safe-place ?p) (in-sack ?t) (at ?c ?p))
	    :effect (and (recycle ?t) (empty-sack ?c) (not (in-sack ?t)))
	    )

	(:action grab_tool
		:parameters (?c ?p ?l)
		:precondition (and (cleaner ?c) (place ?p) (at ?c ?p) (at ?l ?p) (empty-hands ?c) (or (key ?l) (vacuum ?l))
				)
		:effect (and (holding ?l) (not (empty-hands ?c)) (not (at ?l ?p)))
	)

	(:action drop_tool
		:parameters (?c ?p ?l)
		:precondition (and (cleaner ?c) (place ?p) (at ?c ?p) (holding ?l) (or (key ?l) (vacuum ?l)) )
		:effect (and (at ?l ?p) (empty-hands ?c) (not (holding ?l)))
	)

	(:action put_in_sack
		:parameters (?c ?p ?t)
		:precondition (and (cleaner ?c) (trash ?t) (place ?p) (at ?c ?p) (at ?t ?p) (empty-sack ?c))
		:effect ( and (in-sack ?t) (not (empty-sack ?c)) (not (at ?t ?p)))
	)


	(:action open_room
		:parameters (?c ?from ?to ?k)
		:precondition (and (cleaner ?c) (place ?from) (place ?to) (key ?k) (at ?c ?from)  (door-between ?from ?to)
						(holding ?k) (not (open ?k)))
		:effect (and (not (door-between ?from ?to)) (not (door-between ?to ?from))
			(when (half-open ?k) (open ?k)) (when (not (half-open ?k)) (and (half-open ?k))))
	)

	(:action vacuum_dust
		:parameters (?c ?from ?to ?v)
		:precondition (and (cleaner ?c) (place ?from) (place ?to) (next ?from ?to) (next ?to ?from) (vacuum ?v) (at ?c ?from) (dust-in ?to) (holding ?v))
		:effect (and (not (dust-in ?to)))
	)

)

; problem
(define (problem first_house)
	(:domain messy_house)
		(:objects cleaner trash1 trash2 key vacuum
		    out r11 r12 r22 r32 r13 r23 r33 r14 r24 r34 r44 r15)
		(:init  (trash trash1) (trash trash2) (cleaner cleaner) (key key) (vacuum vacuum)
		        (at cleaner r14) (at trash2 r44) (at trash1 r11) (dust-in r32)
				(at vacuum r15) (at key r34)
				(empty-hands cleaner) (safe-place out) (empty-sack cleaner)
				
				(place r11) (place r12) (place r13) (place r14) (place r15)
				(place r22) (place r23) (place r24) (place r32) (place r33)
				(place r34) (place r44) (place out)
				(next r11 r12) (next r12 r11) (next r12 r22) (next r22 r12) (next r12 r13) (next r13 r12)
				(next r22 r23) (next r23 r22) (next r22 r32) (next r32 r22) (next r32 r33) (next r33 r32)
				(next r13 r14) (next r14 r13) (next r13 r23) (next r23 r13) (next r23 r24) (next r24 r23)
				(next r23 r33) (next r33 r23) (next r33 r34) (next r34 r33)
				(next r14 out) (next out r14) (next r14 r15) (next r15 r14)
				(next r14 r24) (next r24 r14) (next r24 r34) (next r34 r24) (next r34 r44) (next r44 r34)

				(door-between r11 r12) (door-between r12 r11) (door-between r12 r13) (door-between r13 r12)
				(door-between r22 r23) (door-between r23 r22) (door-between r34 r44) (door-between r44 r34)
		)
		(:goal (and (recycle trash1) (recycle trash2)))
)

; plan
1. (move cleaner r14 r24)
   deleted: (at cleaner r14)
   added: (at cleaner r24)
   goals met: 0 of 2
2. (move cleaner r24 r34)
   deleted: (at cleaner r24)
   added: (at cleaner r34)
   goals met: 0 of 2
3. (grab_tool cleaner r34 key)
   deleted: (empty-hands cleaner) (at key r34)
   added: (holding key)
   goals met: 0 of 2
4. (open_room cleaner r34 r44 key)
   deleted: (door-between r34 r44) (door-between r44 r34)
   added: (half-open key)
   goals met: 0 of 2
5. (move cleaner r34 r44)
   deleted: (at cleaner r34)
   added: (at cleaner r44)
   goals met: 0 of 2
6. (put_in_sack cleaner r44 trash2)
   deleted: (empty-sack cleaner) (at trash2 r44)
   added: (in-sack trash2)
   goals met: 0 of 2
7. (move cleaner r44 r34)
   deleted: (at cleaner r44)
   added: (at cleaner r34)
   goals met: 0 of 2
8. (move cleaner r34 r24)
   deleted: (at cleaner r34)
   added: (at cleaner r24)
   goals met: 0 of 2
9. (move cleaner r24 r14)
   deleted: (at cleaner r24)
   added: (at cleaner r14)
   goals met: 0 of 2
10. (move cleaner r14 out)
   deleted: (at cleaner r14)
   added: (at cleaner out)
   goals met: 0 of 2
11. (recycle_trash cleaner out trash2)
   deleted: (in-sack trash2)
   added: (recycle trash2) (empty-sack cleaner)
   goals met: 1 of 2
12. (move cleaner out r14)
   deleted: (at cleaner out)
   added: (at cleaner r14)
   goals met: 1 of 2
13. (drop_tool cleaner r14 key)
   deleted: (holding key)
   added: (at key r14) (empty-hands cleaner)
   goals met: 1 of 2
14. (move cleaner r14 r15)
   deleted: (at cleaner r14)
   added: (at cleaner r15)
   goals met: 1 of 2
15. (grab_tool cleaner r15 vacuum)
   deleted: (empty-hands cleaner) (at vacuum r15)
   added: (holding vacuum)
   goals met: 1 of 2
16. (move cleaner r15 r14)
   deleted: (at cleaner r15)
   added: (at cleaner r14)
   goals met: 1 of 2
17. (drop_tool cleaner r14 vacuum)
   deleted: (holding vacuum)
   added: (at vacuum r14) (empty-hands cleaner)
   goals met: 1 of 2
18. (grab_tool cleaner r14 key)
   deleted: (empty-hands cleaner) (at key r14)
   added: (holding key)
   goals met: 1 of 2
19. (move cleaner r14 r13)
   deleted: (at cleaner r14)
   added: (at cleaner r13)
   goals met: 1 of 2
20. (drop_tool cleaner r13 key)
   deleted: (holding key)
   added: (at key r13) (empty-hands cleaner)
   goals met: 1 of 2
21. (move cleaner r13 r14)
   deleted: (at cleaner r13)
   added: (at cleaner r14)
   goals met: 1 of 2
22. (grab_tool cleaner r14 vacuum)
   deleted: (empty-hands cleaner) (at vacuum r14)
   added: (holding vacuum)
   goals met: 1 of 2
23. (move cleaner r14 r13)
   deleted: (at cleaner r14)
   added: (at cleaner r13)
   goals met: 1 of 2
24. (drop_tool cleaner r13 vacuum)
   deleted: (holding vacuum)
   added: (at vacuum r13) (empty-hands cleaner)
   goals met: 1 of 2
25. (grab_tool cleaner r13 key)
   deleted: (empty-hands cleaner) (at key r13)
   added: (holding key)
   goals met: 1 of 2
26. (move cleaner r13 r23)
   deleted: (at cleaner r13)
   added: (at cleaner r23)
   goals met: 1 of 2
27. (drop_tool cleaner r23 key)
   deleted: (holding key)
   added: (at key r23) (empty-hands cleaner)
   goals met: 1 of 2
28. (move cleaner r23 r13)
   deleted: (at cleaner r23)
   added: (at cleaner r13)
   goals met: 1 of 2
29. (grab_tool cleaner r13 vacuum)
   deleted: (empty-hands cleaner) (at vacuum r13)
   added: (holding vacuum)
   goals met: 1 of 2
30. (move cleaner r13 r23)
   deleted: (at cleaner r13)
   added: (at cleaner r23)
   goals met: 1 of 2
31. (drop_tool cleaner r23 vacuum)
   deleted: (holding vacuum)
   added: (at vacuum r23) (empty-hands cleaner)
   goals met: 1 of 2
32. (grab_tool cleaner r23 key)
   deleted: (empty-hands cleaner) (at key r23)
   added: (holding key)
   goals met: 1 of 2
33. (move cleaner r23 r13)
   deleted: (at cleaner r23)
   added: (at cleaner r13)
   goals met: 1 of 2
34. (move cleaner r13 r14)
   deleted: (at cleaner r13)
   added: (at cleaner r14)
   goals met: 1 of 2
35. (drop_tool cleaner r14 key)
   deleted: (holding key)
   added: (at key r14) (empty-hands cleaner)
   goals met: 1 of 2
36. (move cleaner r14 r13)
   deleted: (at cleaner r14)
   added: (at cleaner r13)
   goals met: 1 of 2
37. (move cleaner r13 r23)
   deleted: (at cleaner r13)
   added: (at cleaner r23)
   goals met: 1 of 2
38. (grab_tool cleaner r23 vacuum)
   deleted: (empty-hands cleaner) (at vacuum r23)
   added: (holding vacuum)
   goals met: 1 of 2
39. (move cleaner r23 r33)
   deleted: (at cleaner r23)
   added: (at cleaner r33)
   goals met: 1 of 2
40. (vacuum_dust cleaner r33 r32 vacuum)
   deleted: (dust-in r32)
   goals met: 1 of 2
41. (move cleaner r33 r34)
   deleted: (at cleaner r33)
   added: (at cleaner r34)
   goals met: 1 of 2
42. (move cleaner r34 r44)
   deleted: (at cleaner r34)
   added: (at cleaner r44)
   goals met: 1 of 2
43. (drop_tool cleaner r44 vacuum)
   deleted: (holding vacuum)
   added: (at vacuum r44) (empty-hands cleaner)
   goals met: 1 of 2
44. (move cleaner r44 r34)
   deleted: (at cleaner r44)
   added: (at cleaner r34)
   goals met: 1 of 2
45. (move cleaner r34 r24)
   deleted: (at cleaner r34)
   added: (at cleaner r24)
   goals met: 1 of 2
46. (move cleaner r24 r14)
   deleted: (at cleaner r24)
   added: (at cleaner r14)
   goals met: 1 of 2
47. (grab_tool cleaner r14 key)
   deleted: (empty-hands cleaner) (at key r14)
   added: (holding key)
   goals met: 1 of 2
48. (move cleaner r14 r13)
   deleted: (at cleaner r14)
   added: (at cleaner r13)
   goals met: 1 of 2
49. (move cleaner r13 r23)
   deleted: (at cleaner r13)
   added: (at cleaner r23)
   goals met: 1 of 2
50. (move cleaner r23 r33)
   deleted: (at cleaner r23)
   added: (at cleaner r33)
   goals met: 1 of 2
51. (move cleaner r33 r32)
   deleted: (at cleaner r33)
   added: (at cleaner r32)
   goals met: 1 of 2
52. (move cleaner r32 r22)
   deleted: (at cleaner r32)
   added: (at cleaner r22)
   goals met: 1 of 2
53. (move cleaner r22 r12)
   deleted: (at cleaner r22)
   added: (at cleaner r12)
   goals met: 1 of 2
54. (open_room cleaner r12 r11 key)
   deleted: (door-between r12 r11) (door-between r11 r12)
   added: (open key)
   goals met: 1 of 2
55. (move cleaner r12 r11)
   deleted: (at cleaner r12)
   added: (at cleaner r11)
   goals met: 1 of 2
56. (put_in_sack cleaner r11 trash1)
   deleted: (empty-sack cleaner) (at trash1 r11)
   added: (in-sack trash1)
   goals met: 1 of 2
57. (move cleaner r11 r12)
   deleted: (at cleaner r11)
   added: (at cleaner r12)
   goals met: 1 of 2
58. (move cleaner r12 r22)
   deleted: (at cleaner r12)
   added: (at cleaner r22)
   goals met: 1 of 2
59. (move cleaner r22 r32)
   deleted: (at cleaner r22)
   added: (at cleaner r32)
   goals met: 1 of 2
60. (move cleaner r32 r33)
   deleted: (at cleaner r32)
   added: (at cleaner r33)
   goals met: 1 of 2
61. (move cleaner r33 r34)
   deleted: (at cleaner r33)
   added: (at cleaner r34)
   goals met: 1 of 2
62. (move cleaner r34 r24)
   deleted: (at cleaner r34)
   added: (at cleaner r24)
   goals met: 1 of 2
63. (move cleaner r24 r14)
   deleted: (at cleaner r24)
   added: (at cleaner r14)
   goals met: 1 of 2
64. (move cleaner r14 out)
   deleted: (at cleaner r14)
   added: (at cleaner out)
   goals met: 1 of 2
65. (recycle_trash cleaner out trash1)
   deleted: (in-sack trash1)
   added: (recycle trash1) (empty-sack cleaner)
   goals met: 2 of 2
